Sinsjr2/Arcavirt/doc/spec/RegisterSvdReference/rx64m-s12ad-pilot.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.3">
  <name>RX64M_S12AD_Pilot</name>
  <version>1.0</version>
  <description>RX64M_S12AD_Pilot peripheral registers generated from iodefine.h (pilot).</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>S12AD</name>
      <baseAddress>0x89000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADCSR</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>DBLANS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GBADIE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBLE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTRG</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADIE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCS</name>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADST</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADANSA0</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADADS0</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADS0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADADC</name>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AVEE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCER</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADPRC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ACE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIAGVAL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DIAGLD</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIAGM</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADRFMT</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSTRGR</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TRSB</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRSA</name>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADANSB0</name>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ANSB0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDBLDR</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>AD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADRD</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>DIAGST</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AD</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0</name>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR1</name>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR2</name>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR3</name>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR4</name>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR5</name>
          <addressOffset>0x2A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR6</name>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR7</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADSSTR0</name>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSHCR</name>
          <addressOffset>0x66</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x18</resetValue>
          <fields>
            <field>
              <name>SSTSH</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SHANS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSSTR1</name>
          <addressOffset>0x73</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR2</name>
          <addressOffset>0x74</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR3</name>
          <addressOffset>0x75</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR4</name>
          <addressOffset>0x76</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR5</name>
          <addressOffset>0x77</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR6</name>
          <addressOffset>0x78</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR7</name>
          <addressOffset>0x79</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADDISCR</name>
          <addressOffset>0x7A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADNDIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSHMSR</name>
          <addressOffset>0x7C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>SHMD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADGSPCR</name>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>PGS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GBRSCN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GBRP</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDBLDRA</name>
          <addressOffset>0x84</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDBLDRB</name>
          <addressOffset>0x86</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCMPCR</name>
          <addressOffset>0x90</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WCMPE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPIE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPANSR0</name>
          <addressOffset>0x94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPS0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPLR0</name>
          <addressOffset>0x98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPL0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPDR0</name>
          <addressOffset>0x9C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCMPDR1</name>
          <addressOffset>0x9E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCMPSR0</name>
          <addressOffset>0xA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPF0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
