Sinsjr2/Arcavirt/doc/spec/RegisterSvdReference/rx64m-s12ad-pilot.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>S12AD1</name>
      <baseAddress>0x89100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA5</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADCSR</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>DBLANS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GBADIE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DBLE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTRG</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADIE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCS</name>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADST</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADANSA0</name>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADANSA1</name>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ANSA1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADADS0</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADS0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADADS1</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADS1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADADC</name>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AVEE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCER</name>
          <addressOffset>0xE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADPRC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ACE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIAGVAL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DIAGLD</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIAGM</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADRFMT</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSTRGR</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TRSB</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>TRSA</name>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADEXICR</name>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TSSAD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCSAD</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSA</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCSA</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSSB</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCSB</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXSEL</name>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXOEN</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADANSB0</name>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ANSB0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADANSB1</name>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ANSB1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDBLDR</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADTSDR</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADOCDR</name>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADRD</name>
          <addressOffset>0x1E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>DIAGST</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AD</name>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR0</name>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR1</name>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR2</name>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR3</name>
          <addressOffset>0x26</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR4</name>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR5</name>
          <addressOffset>0x2A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR6</name>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR7</name>
          <addressOffset>0x2E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR8</name>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR9</name>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR10</name>
          <addressOffset>0x34</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR11</name>
          <addressOffset>0x36</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR12</name>
          <addressOffset>0x38</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR13</name>
          <addressOffset>0x3A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR14</name>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR15</name>
          <addressOffset>0x3E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR16</name>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR17</name>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR18</name>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR19</name>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDR20</name>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADSSTR0</name>
          <addressOffset>0x60</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTRL</name>
          <addressOffset>0x61</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTRT</name>
          <addressOffset>0x70</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTRO</name>
          <addressOffset>0x71</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR1</name>
          <addressOffset>0x73</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR2</name>
          <addressOffset>0x74</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR3</name>
          <addressOffset>0x75</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR4</name>
          <addressOffset>0x76</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR5</name>
          <addressOffset>0x77</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR6</name>
          <addressOffset>0x78</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADSSTR7</name>
          <addressOffset>0x79</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xB</resetValue>
        </register>
        <register>
          <name>ADDISCR</name>
          <addressOffset>0x7A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>ADNDIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADGSPCR</name>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>PGS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GBRSCN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GBRP</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDBLDRA</name>
          <addressOffset>0x84</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADDBLDRB</name>
          <addressOffset>0x86</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCMPCR</name>
          <addressOffset>0x90</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>WCMPE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPIE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPANSER</name>
          <addressOffset>0x92</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPSTS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPSOC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPLER</name>
          <addressOffset>0x93</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPLTS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPLOC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPANSR0</name>
          <addressOffset>0x94</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPS0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPANSR1</name>
          <addressOffset>0x96</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPS1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPLR0</name>
          <addressOffset>0x98</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPL0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPLR1</name>
          <addressOffset>0x9A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPL1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPDR0</name>
          <addressOffset>0x9C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCMPDR1</name>
          <addressOffset>0x9E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCMPSR0</name>
          <addressOffset>0xA0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPF0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPSR1</name>
          <addressOffset>0xA2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPF1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMPSER</name>
          <addressOffset>0xA4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>CMPFTS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMPFOC</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>